index=wineventlog EventCode=1 Image!="C:\\Program Files\\SplunkUniversalForwarder\\*"
| where (
        
        like(CommandLine, "%procdump%") AND like(CommandLine, "%lsass%")
        OR like(CommandLine, "%comsvcs.dll%") AND like(CommandLine, "%MiniDump%")
        OR like(CommandLine, "%rundll32.exe%") AND like(CommandLine, "%comsvcs.dll%")
        OR like(CommandLine, "%lsass.dmp%")
        OR like(CommandLine, "%lsass%") AND like(CommandLine, "%.dmp%")

        
        OR match(CommandLine, "(?i)mimikatz")
        OR match(CommandLine, "(?i)sekurlsa")

  
        OR like(CommandLine, "%lsass.exe%") AND (
                like(CommandLine, "%-ma%") OR like(CommandLine, "%-mp%") OR like(CommandLine, "%-r%")
        )
    )
| table _time ComputerName User Image ParentImage CommandLine
