index=wineventlog EventCode=1 Image!="C:\\Program Files\\SplunkUniversalForwarder\\*"
| where 
    (like(Image, "%\\schtasks.exe") AND (
        like(CommandLine, "% /create%") OR 
        like(CommandLine, "% /change%") OR
        like(CommandLine, "% /run%") OR
        like(CommandLine, "% /delete%")
    ))
    OR match(CommandLine, "(?i)Register-ScheduledTask")
    OR match(CommandLine, "(?i)New-ScheduledTask")
    OR match(CommandLine, "(?i)Set-ScheduledTask")
    OR like(CommandLine, "%.xml") AND like(CommandLine, "%schtasks%")
| table _time ComputerName User Image ParentImage CommandLine
